[
  {
    "id": 1,
    "title": "Junglytics",
    "description": "Junglytics es una plataforma de análisis para vendedores de Amazon. Permite visualizar métricas clave, gestionar inventario y optimizar la rentabilidad de productos FBA.",
    "full_description": "Junglytics es una herramienta web orientada a vendedores de Amazon. La plataforma centraliza y visualiza datos clave de ventas, costos, comisiones, inventario y rentabilidad, permitiendo tomar decisiones basadas en métricas en tiempo real. Entre sus funcionalidades se incluyen dashboards financieros, reportes detallados de producto y herramientas para optimizar el desempeño de cada ítem en el marketplace. Su objetivo es facilitar la gestión operativa y estratégica del negocio dentro del ecosistema de Amazon",
    "images": [
      { "url": "/images/junglytics/junglytics-1.png", "alt": "Junglytics image 1" },
      { "url": "/images/junglytics/junglytics-2.png", "alt": "Junglytics image 2" },
      { "url": "/images/junglytics/junglytics-3.png", "alt": "Junglytics image 3" }
    ],
    "start_date": "Marzo de 2022",
    "end_date": "Diciembre de 2022",
    "challenges": "Integración de multiples y variados tipos de datos, dashboards interactivos, tablas de datos, gráficos, estadisticas y reportes. Integración con APIs de terceros, autenticación y gestión de usuarios basada en roles.",
    "long_role_explanation": "Me encargué del desarrollo frontend con React, generando una interfaz visual basada en un diseño predefinido via Figma. Implementé la lógica de negocio brindada por los clientes y estuve a cargo de la implementacion de multiples tipos de graficos, tablas e informacion visual clave para el usuario.",
    "technologies": ["React", "AWS", "MaterialUI", "Styled Components", "Typescript"],
    "slug": "junglytics"
  },
  {
    "id": 2,
    "title": "Nicer",
    "description": "Un ecosistema completo para la gestión de viajes. Gestiona itinerarios, pagos, reservas y manten comunicación con los viajeros.",
    "full_description": "Nicer se define a si misma como el futuro de los viajes, se trata de una plataforma que brinda a los travel advisors multiples herramientas para gestionar viajes de manera eficiente y personalizada, incluyendo un sistema de gestión de itinerarios, pagos, reservas y comunicación con los viajeros. Un ecosistema todo en uno que invluye multiples sitios web y su propia aplicacion nativa.",
    "images": [
      { "url": "/images/nicer/nicer-2.png", "alt": "Nicer image 2" },
      { "url": "/images/nicer/nicer-1.png", "alt": "Nicer image 1" },
      { "url": "/images/nicer/nicer-3.png", "alt": "Nicer image 3" }
    ],
    "start_date": "Abril de 2024",
    "end_date": "En desarrollo",
    "challenges": "Integración de múltiples APIs de terceros, integracion de un CMS, integración de pagos, gestion de itinerarios complejos y multiples reglas de negocio. Tambien construimos nuestra propia libreria de componentes para el desarrollo frontend.",
    "long_role_explanation": "Me encargo del desarrollo y mantenimiento del frontend de los multiples sitios web y la aplicación nativa, así como de la integración con las APIs de terceros. Actualmente coexisten 5 sitios webs diferentes y una aplicacion mobile.",
    "technologies": [
      "React",
      "React Native",
      "Next.js",
      "Sass",
      "AWS",
      "Vite",
      "Contentful",
      "TailwindCSS",
      "Typescript"
    ],
    "slug": "nicer"
  }
]
